<!DOCTYPE html>
<html lang="fr">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="Politique de confidentialité de l'application Rappel - Application de gestion de rappels personnels pour Android et iOS.">
    <meta name="keywords" content="Rappel, Privacy Policy, Politique de confidentialité, Android, iOS, Application mobile">
    <meta name="author" content="Adrien Michaud">
    <title>Rappel - Politique de confidentialité | Adrien Michaud</title>
    <link rel="stylesheet" href="main.css">
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Inter:wght@300;400;500;600;700&display=swap" rel="stylesheet">
</head>
<body>
    <!-- Navigation -->
    <nav class="navbar">
        <div class="container nav-container">
            <a href="index.html" class="nav-brand">AM</a>
            <ul class="nav-menu">
                <li><a href="index.html" class="nav-link">Home</a></li>
                <li><a href="index.html#projects" class="nav-link">All Projects</a></li>
                <li><a href="index.html#contact" class="nav-link">Contact</a></li>
            </ul>
        </div>
    </nav>

    <!-- Hero -->
    <header class="project-hero">
        <div class="container">
            <a href="index.html#projects" class="back-link">&larr; Back to Projects</a>
            <h1 class="project-title">Rappel</h1>
            <p class="project-tagline">Politique de confidentialit&eacute;</p>
            <div class="project-meta">
                <span class="meta-item">Derni&egrave;re mise &agrave; jour : 11 f&eacute;vrier 2026</span>
            </div>
        </div>
    </header>

    <!-- Content -->
    <main class="project-content">
        <div class="container">

            <!-- Introduction -->
            <section class="content-section">
                <h2>Introduction</h2>
                <p>Rappel est une application de gestion de rappels personnels (factures, sant&eacute;, courses, etc.) d&eacute;velopp&eacute;e par Adrien Michaud. La protection de vos donn&eacute;es personnelles est une priorit&eacute;. Cette politique de confidentialit&eacute; d&eacute;crit quelles donn&eacute;es sont collect&eacute;es, comment elles sont stock&eacute;es et utilis&eacute;es.</p>
                <p><strong>En r&eacute;sum&eacute; : toutes vos donn&eacute;es restent exclusivement sur votre appareil. Aucune donn&eacute;e n'est transmise &agrave; des serveurs externes ni partag&eacute;e avec des tiers.</strong></p>
            </section>

            <!-- Donn&eacute;es collect&eacute;es -->
            <section class="content-section">
                <h2>Donn&eacute;es collect&eacute;es</h2>
                <p>L'application stocke les donn&eacute;es suivantes <strong>localement sur votre appareil</strong> dans une base de donn&eacute;es SQLite :</p>

                <div class="features-list">
                    <div class="feature-item">
                        <h3>Profil utilisateur</h3>
                        <p>Nom d'affichage, avatar, devise pr&eacute;f&eacute;r&eacute;e, pr&eacute;f&eacute;rences de th&egrave;me et param&egrave;tres de notification. Aucun mot de passe, adresse e-mail ou identifiant externe n'est collect&eacute;.</p>
                    </div>
                    <div class="feature-item">
                        <h3>Rappels</h3>
                        <p>Titre, date d'&eacute;ch&eacute;ance, montant (optionnel), notes (optionnel), statut, r&eacute;currence, cat&eacute;gorie, priorit&eacute; et &eacute;tiquettes.</p>
                    </div>
                    <div class="feature-item">
                        <h3>Organisation</h3>
                        <p>Cat&eacute;gories, &eacute;tiquettes et priorit&eacute;s personnalis&eacute;es que vous cr&eacute;ez pour organiser vos rappels.</p>
                    </div>
                </div>
            </section>

            <!-- Stockage -->
            <section class="content-section">
                <h2>Stockage des donn&eacute;es</h2>
                <div class="challenges-list">
                    <div class="challenge-item">
                        <h3>Stockage local uniquement</h3>
                        <p>Toutes les donn&eacute;es sont stock&eacute;es exclusivement dans le stockage interne de votre appareil. L'application ne dispose d'aucun serveur distant, d'aucune base de donn&eacute;es cloud et d'aucun syst&egrave;me de synchronisation. Vos donn&eacute;es ne quittent jamais votre appareil.</p>
                    </div>
                    <div class="challenge-item">
                        <h3>Isolation des profils</h3>
                        <p>Si plusieurs profils sont cr&eacute;&eacute;s sur le m&ecirc;me appareil, les donn&eacute;es de chaque profil sont strictement isol&eacute;es les unes des autres.</p>
                    </div>
                </div>
            </section>

            <!-- Transmission -->
            <section class="content-section">
                <h2>Transmission des donn&eacute;es</h2>
                <div class="impact-stats">
                    <div class="stat-item">
                        <h3>Aucune transmission</h3>
                        <p>L'application ne transmet aucune donn&eacute;e &agrave; des serveurs externes. Aucune API distante n'est appel&eacute;e.</p>
                    </div>
                    <div class="stat-item">
                        <h3>Aucun suivi</h3>
                        <p>L'application n'int&egrave;gre aucun outil d'analyse (analytics), de suivi comportemental ou de publicit&eacute;.</p>
                    </div>
                    <div class="stat-item">
                        <h3>Aucun partage</h3>
                        <p>Vos donn&eacute;es ne sont jamais partag&eacute;es avec des tiers, des annonceurs ou des partenaires.</p>
                    </div>
                </div>
            </section>

            <!-- Permissions -->
            <section class="content-section">
                <h2>Permissions de l'application</h2>
                <p>L'application demande les permissions suivantes, toutes utilis&eacute;es exclusivement pour des fonctionnalit&eacute;s locales :</p>

                <div class="features-list">
                    <div class="feature-item">
                        <h3>Notifications (POST_NOTIFICATIONS)</h3>
                        <p>Permet d'envoyer des notifications locales pour vous rappeler vos &eacute;ch&eacute;ances. Les notifications sont g&eacute;r&eacute;es enti&egrave;rement sur l'appareil, sans serveur de notifications distant.</p>
                    </div>
                    <div class="feature-item">
                        <h3>Alarmes exactes (SCHEDULE_EXACT_ALARM)</h3>
                        <p>Permet de planifier des notifications pr&eacute;cises &agrave; l'heure exacte de vos rappels.</p>
                    </div>
                    <div class="feature-item">
                        <h3>D&eacute;marrage (RECEIVE_BOOT_COMPLETED)</h3>
                        <p>Permet de reprogrammer vos notifications apr&egrave;s un red&eacute;marrage de l'appareil.</p>
                    </div>
                    <div class="feature-item">
                        <h3>Internet et r&eacute;seau (INTERNET, ACCESS_NETWORK_STATE)</h3>
                        <p>Requis par le framework .NET MAUI. L'application ne transmet aucune donn&eacute;e via le r&eacute;seau.</p>
                    </div>
                </div>
            </section>

            <!-- Notifications -->
            <section class="content-section">
                <h2>Notifications</h2>
                <p>Les notifications sont g&eacute;n&eacute;r&eacute;es et affich&eacute;es localement sur votre appareil. Par mesure de s&eacute;curit&eacute; :</p>
                <div class="challenges-list">
                    <div class="challenge-item">
                        <h3>Protection des donn&eacute;es sensibles</h3>
                        <p>Les montants financiers et les d&eacute;tails m&eacute;dicaux ne sont jamais affich&eacute;s dans les notifications. Seul le titre du rappel appara&icirc;t dans la notification.</p>
                    </div>
                </div>
            </section>

            <!-- Sauvegardes -->
            <section class="content-section">
                <h2>Sauvegardes</h2>
                <p>Sur Android, la sauvegarde automatique de l'appareil peut inclure les donn&eacute;es de l'application si vous avez activ&eacute; la sauvegarde cloud dans les param&egrave;tres de votre appareil. Cette sauvegarde est g&eacute;r&eacute;e par le syst&egrave;me d'exploitation Android et Google, et non par l'application Rappel.</p>
            </section>

            <!-- Suppression -->
            <section class="content-section">
                <h2>Suppression des donn&eacute;es</h2>
                <p>Vous avez un contr&ocirc;le total sur vos donn&eacute;es :</p>
                <div class="features-list">
                    <div class="feature-item">
                        <h3>Suppression individuelle</h3>
                        <p>Vous pouvez supprimer &agrave; tout moment un rappel, une cat&eacute;gorie, une &eacute;tiquette ou une priorit&eacute; depuis l'application.</p>
                    </div>
                    <div class="feature-item">
                        <h3>Suppression compl&egrave;te</h3>
                        <p>La suppression d'un profil entra&icirc;ne la suppression d&eacute;finitive de toutes les donn&eacute;es associ&eacute;es. La d&eacute;sinstallation de l'application supprime &eacute;galement toutes les donn&eacute;es locales.</p>
                    </div>
                </div>
            </section>

            <!-- Enfants -->
            <section class="content-section">
                <h2>Enfants</h2>
                <p>L'application Rappel n'est pas destin&eacute;e aux enfants de moins de 13 ans et ne collecte pas sciemment de donn&eacute;es les concernant. L'application ne n&eacute;cessite aucune cr&eacute;ation de compte et ne collecte aucune information personnelle identifiable.</p>
            </section>

            <!-- Modifications -->
            <section class="content-section">
                <h2>Modifications de cette politique</h2>
                <p>Cette politique de confidentialit&eacute; peut &ecirc;tre mise &agrave; jour. Toute modification sera publi&eacute;e sur cette page avec une date de mise &agrave; jour actualis&eacute;e. Nous vous encourageons &agrave; consulter r&eacute;guli&egrave;rement cette page.</p>
            </section>

            <!-- Contact -->
            <section class="content-section">
                <h2>Contact</h2>
                <p>Si vous avez des questions concernant cette politique de confidentialit&eacute;, vous pouvez me contacter :</p>
                <div class="project-links">
                    <a href="mailto:michaudadrien78@gmail.com" class="project-link">michaudadrien78@gmail.com &rarr;</a>
                    <a href="https://www.linkedin.com/in/adrienmichaud/" target="_blank" class="project-link">LinkedIn &rarr;</a>
                </div>
            </section>

        </div>
    </main>

    <!-- Footer -->
    <footer class="footer">
        <div class="container">
            <p>&copy; 2025 Adrien Michaud. All rights reserved.</p>
            <p>.NET & Full Stack Developer based in Neuch&acirc;tel, Switzerland</p>
        </div>
    </footer>

    <script>
        document.querySelectorAll('a[href^="#"]').forEach(anchor => {
            anchor.addEventListener('click', function (e) {
                e.preventDefault();
                const target = document.querySelector(this.getAttribute('href'));
                if (target) {
                    target.scrollIntoView({
                        behavior: 'smooth',
                        block: 'start'
                    });
                }
            });
        });
    </script>
</body>
</html>
